org/articles/Perl/2013-06-12-Mojolicious-analyse-2.org
#+begin_html
---
date: 2013-06-12
template: tech.jade
title: Mojolicious Web框架实现分析 -- 请求处理过程
category: Perl
change_frequency: monthly
---
#+end_html

Mojolicious 是基于事件的web框架，那么如何知道请求这个事件发生了呢？

由于请求是通过网络上达到，通过Client对server监听的端口发起链接而产生，这一事件是accept事件，Mojolicious得知这一事件的方法有两种:
- 使用IO::Poll 模块，隔一段时间进行一次轮询，问内核:是否有链接了？ 这个轮询是被ioloop->start所启动
- 使用EV模块， 注册一个回调函数，在链接到达的时候，这个回调函数会被EV模块调用．

不论哪种方式(主动查询还是被动通告)，当一个socket上的accept事件发生的时候，Mojolicious被唤醒
- IO::Pool模式
  此模式下轮询函数是Mojo::Reactor::one\_tick方法，可以看到当可读/写发生时候，调用:
  #+BEGIN_SRC perl :eval no
   ++$i and $self->_sandbox('Write'， $self->{io}{fileno $_}{cb}， 1)
  #+END_SRC
- EV模式
  \_io方法会被调用，进而调用注册的回调:
  #+BEGIN_SRC perl :eval no
  my $io = $self->{io}{$fd};
  $self->_sandbox('Read'， $io->{cb}， 0) if EV::READ &$revents;
  #+END_SRC

因此从处理函数被调用开始分析一个请求的处理过程

** 请求处理过程

*** listen socket上面的回调
   socket对应fd上面的回调， 这个回调在哪注册的呢？\\
   Mojo::IOLoop在创建server实例的时候，创建完毕会执行一个:
     #+BEGIN_SRC perl :eval no
     return $self->acceptor($server);
     #+END_SRC
     来将$server实例记录在$self->{acceptors}中，最后执行:
     #+BEGIN_SRC perl :eval no
     # Stop accepting so new acceptor can get picked up
     $self->_not_accepting;
     #+END_SRC
     这里释放accept锁，表示其他进程的server可以进行注册accept处理函数到accept的socket．\\
     在释放锁的同时，注意到\_not\_accepting函数内首先启动了一个定时器:
     #+BEGIN_SRC perl :eval no
     $self->_timers;
     ．．．
     sub _timers {
           my $self = shift;
           $self->{accept} ||= $self->recurring($self->accept_interval => \&_accepting);
           $self->{stop} ||= $self->recurring(1 => \&_stop);
     }
     #+END_SRC
     启动了定时的执行\_accepting，注意，同一个进程内不会启动多个．
     #+BEGIN_SRC perl :eval no
     sub _accepting {
      my $self = shift;
    
      # Check if we have acceptors
      my $acceptors = $self->{acceptors} ||= {};
      return $self->_remove(delete $self->{accept}) unless keys %$acceptors;
    
      # Check connection limit
      my $i   = keys %{$self->{connections}};
      my $max = $self->max_connections;
      return unless $i < $max;
    
      # Acquire accept mutex
      if (my $cb = $self->lock) { return unless $self->$cb(!$i) }
      $self->_remove(delete $self->{accept});
    
      # Check if multi-accept is desirable
      my $multi = $self->multi_accept;
      $_->multi_accept($max < $multi ? 1 : $multi)->start for values %$acceptors;
      $self->{accepting}++;
    }
     #+END_SRC
     此方法每隔一段时间运行一次，目的是注册accept的事件处理，直到成功注册(便会停止尝试)．\\
     什么时候失败呢？
     - 锁没获取，其它进程的server获取了锁，已经注册了
     - 链接数达到了最大链接数
     如果获取了锁，则进行注册处理函数，这在Mojo::IOLoop::Server:start方法内进行:
     #+BEGIN_SRC perl :eval no
     sub start {
      my $self = shift;
      weaken $self;
      $self->reactor->io(
        $self->{handle} => sub { $self->_accept for 1 ．． $self->multi_accept });
     }
     #+END_SRC
     设置server的handle(是socket的fd)的处理函数为\_accept方法．multi\_accept表示一次可以获取多个可以accept的链接:
     #+BEGIN_SRC perl :eval no
     sub _accept {
       my $self = shift;
     
       return unless my $handle = $self->{handle}->accept;
       $handle->blocking(0);
     
       # Disable Nagle's algorithm
       setsockopt $handle， IPPROTO_TCP， TCP_NODELAY， 1;
     
       # Start TLS handshake
       return $self->emit_safe(accept => $handle) unless my $tls = $self->{tls};
       weaken $self;
       $tls->{SSL_error_trap} = sub {
         return unless my $handle = delete $self->{handles}{shift()};
         $self->reactor->remove($handle);
         close $handle;
       };
       return unless $handle = IO::Socket::SSL->start_SSL($handle， %$tls);
       $self->reactor->io($handle => sub { $self->_tls($handle) });
       $self->{handles}{$handle} = $handle;
     }
   #+END_SRC
