www/articles/Perl/2013/06/12/2013-06-12-Mojolicious-analyse-2.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="chrome=1">
    <meta name="viewport" content="width=device-width">
    <title>Mojolicious Web框架实现分析 -- 请求处理过程 - The Chinaxing's blog
    </title>
    <link rel="stylesheet" href="/css/styles.css">
  </head>
  <body>
    <header id="header">
      <div id="menu">
        <div id="menu-header"><a id="site-name" href="/">ChinaXing</a><a id="github-icon" data-icon="&#xf00a" title="View Github profile" href="http://chinaxing.org"></a></div>
        <ul id="menu-list">
          <li><a href="/Java/index.html">Java<sup>6</sup></a></li>
          <li><a href="/Life/index.html">Life<sup>2</sup></a></li>
          <li><a href="/Linux/index.html">Linux<sup>23</sup></a></li>
          <li class="active"><a href="/Perl/index.html">Perl<sup>22</sup></a></li>
          <li><a href="/Postgres/index.html">Postgres<sup>2</sup></a></li>
          <li><a href="/Python/index.html">Python<sup>1</sup></a></li>
        </ul>
        <!-- vistor map-->
        <div id="clustrmaps-widget"></div>
      </div>
    </header>
    <section id="content">
      <h2 style="text-align:center">Mojolicious Web框架实现分析 -- 请求处理过程
      </h2>
      <div id="toc">Table of Content
        <ol></ol>
      </div>
      <div class="tech">

<p>
Mojolicious&nbsp;是基于事件的web框架，那么如何知道请求这个事件发生了呢？
</p>
<p>
由于请求是通过网络上达到，通过Client对server监听的端口发起链接而产生，这一事件是accept事件，Mojolicious得知这一事件的方法有两种:
</p><ul>
<li>使用<span class="caps">IO</span>::Poll 模块，隔一段时间进行一次轮询，问内核:是否有链接了？&nbsp;这个轮询是被ioloop-&gt;start所启动
</li>
<li>使用<span class="caps">EV</span>模块，&nbsp;注册一个回调函数，在链接到达的时候，这个回调函数会被EV模块调用．
</li>
</ul>


<p>
不论哪种方式(主动查询还是被动通告)，当一个socket上的accept事件发生的时候，Mojolicious被唤醒
</p><ul>
<li><span class="caps">IO</span>::Pool模式
  此模式下轮询函数是Mojo::Reactor::one_tick方法，可以看到当可读/写发生时候，调用:



<pre class="src src-perl">++$i <span style="color: #ff7f50;">and</span> $self-&gt;_sandbox(<span style="color: #ffff00;">'Write'</span>&#65292; $self-&gt;{<span style="color: #ffff00;">io</span>}{<span style="color: #ff7f50;">fileno</span> $_}{<span style="color: #ffff00;">cb</span>}&#65292; 1)
</pre>

</li>
<li><span class="caps">EV</span>模式
  _io方法会被调用，进而调用注册的回调:



<pre class="src src-perl"><span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$io</span> = $self-&gt;{<span style="color: #ffff00;">io</span>}{$fd};
$self-&gt;_sandbox(<span style="color: #ffff00;">'Read'</span>&#65292; $io-&gt;{<span style="color: #ffff00;">cb</span>}&#65292; 0) <span style="color: #00ffff;">if</span> <span class="caps">EV</span>::READ &amp;$revents;
</pre>

</li>
</ul>


<p>
因此从处理函数被调用开始分析一个请求的处理过程
</p>

<div id="table-of-contents">
<h2>Table of&nbsp;Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 请求处理过程</a>
<ul>
<li><a href="#sec-1-1">1.1 listen&nbsp;socket上面的回调</a></li>
<li><a href="#sec-1-2">1.2 listen&nbsp;socket上链接达到</a></li>
<li><a href="#sec-1-3">1.3&nbsp;为链接创建Mojo::IOLoop::Stream</a></li>
<li><a href="#sec-1-4">1.4&nbsp;client发来数据</a></li>
<li><a href="#sec-1-5">1.5&nbsp;transaction被创建并处理数据</a></li>
<li><a href="#sec-1-6">1.6&nbsp;数据分析完整触发tx上的request事件</a></li>
<li><a href="#sec-1-7">1.7&nbsp;执行app上的handler方法</a></li>
<li><a href="#sec-1-8">1.8&nbsp;tx被唤醒写response数据到链接</a></li>
<li><a href="#sec-1-9">1.9&nbsp;结束tx</a></li>
</ul>
</li>
<li><a href="#sec-2">2&nbsp;总结</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">请求处理过程</h3>
<div class="outline-text-3" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-4">
<h4 id="sec-1-1">listen&nbsp;socket上面的回调</h4>
<div class="outline-text-4" id="text-1-1">

<p>   socket对应fd上面的回调， 这个回调在哪注册的呢？<br/>&nbsp;Mojo::IOLoop在创建server实例的时候，创建完毕会执行一个:
</p>


<pre class="src src-perl"><span style="color: #00ffff;">return</span> $self-&gt;acceptor($server);
</pre>

<p>
     来将$server实例记录在$self-&gt;{acceptors}中，最后执行:
</p>


<pre class="src src-perl"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">Stop accepting so new acceptor can get picked up</span>
$self-&gt;_not_accepting;
</pre>

<p>
     这里释放accept锁，表示其他进程的server可以进行注册accept处理函数到accept的socket．<br/>&nbsp;在释放锁的同时，注意到_not_accepting函数内首先启动了一个定时器:
</p>


<pre class="src src-perl">$self-&gt;_timers;
&#65294;&#65294;&#65294;
<span style="color: #00ffff;">sub</span> <span style="color: #4186be;">_timers</span> {
      <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$self</span> = <span style="color: #66cd00;">shift</span>;
      $self-&gt;{<span style="color: #ffff00;">accept</span>} ||= $self-&gt;recurring($self-&gt;accept_interval =&gt; \&amp;_accepting);
      $self-&gt;{<span style="color: #ffff00;">stop</span>} ||= $self-&gt;recurring(<span style="color: #ffff00;">1</span> =&gt; \&amp;_stop);
}
</pre>

<p>
     启动了定时的执行_accepting，注意，同一个进程内不会启动多个．
</p>


<pre class="src src-perl"> <span style="color: #00ffff;">sub</span> <span style="color: #4186be;">_accepting</span> {
  <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$self</span> = <span style="color: #66cd00;">shift</span>;

  <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Check if we have acceptors</span>
  <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$acceptors</span> = $self-&gt;{<span style="color: #ffff00;">acceptors</span>} ||= {};
  <span style="color: #00ffff;">return</span> $self-&gt;_remove(<span style="color: #66cd00;">delete</span> $self-&gt;{<span style="color: #ffff00;">accept</span>}) <span style="color: #00ffff;">unless</span> <span style="color: #66cd00;">keys</span> <span style="color: #ff0000; background-color: #eeeed1; font-weight: bold; font-style: italic;">%</span><span style="color: #ffffff; font-weight: bold;">$acceptors</span>;

  <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Check connection limit</span>
  <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$i</span>   = <span style="color: #66cd00;">keys</span> %{$self-&gt;{<span style="color: #ffff00;">connections</span>}};
  <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$max</span> = $self-&gt;max_connections;
  <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">unless</span> $i &lt; $max;

  <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Acquire accept mutex</span>
  <span style="color: #00ffff;">if</span> (<span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$cb</span> = $self-&gt;<span style="color: #ff7f50;">lock</span>) { <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">unless</span> $self-&gt;$cb(!$i) }
  $self-&gt;_remove(<span style="color: #66cd00;">delete</span> $self-&gt;{<span style="color: #ffff00;">accept</span>});

  <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Check if multi-accept is desirable</span>
  <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$multi</span> = $self-&gt;multi_accept;
  $_-&gt;multi_accept($max &lt; $multi ? 1 : $multi)-&gt;start <span style="color: #00ffff;">for</span> <span style="color: #ff7f50;">values</span> <span style="color: #ff0000; background-color: #eeeed1; font-weight: bold; font-style: italic;">%</span><span style="color: #ffffff; font-weight: bold;">$acceptors</span>;
  $self-&gt;{<span style="color: #ffff00;">accepting</span>}++;
}
</pre>

<p>
     此方法每隔一段时间运行一次，目的是注册accept的事件处理，直到成功注册(便会停止尝试)．<br/>&nbsp;什么时候失败呢？
</p><ul>
<li>锁没获取，其它进程的server获取了锁，已经注册了
</li>
<li>链接数达到了最大链接数
</li>
</ul>

<p>     如果获取了锁，则进行注册处理函数，这在Mojo::IOLoop::Server:start方法内进行:
</p>


<pre class="src src-perl"><span style="color: #00ffff;">sub</span> <span style="color: #4186be;">start</span> {
 <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$self</span> = <span style="color: #66cd00;">shift</span>;
 weaken $self;
 $self-&gt;reactor-&gt;io(
   $self-&gt;{<span style="color: #ffff00;">handle</span>} =&gt; <span style="color: #00ffff;">sub</span> { $self-&gt;_accept <span style="color: #00ffff;">for</span> 1 &#65294;&#65294; $self-&gt;multi_accept });
}
</pre>

<p>
     设置server的handle(是socket的fd)的处理函数为_accept方法．multi_accept表示一次可以获取多个可以accept的链接:
</p>


<pre class="src src-perl"><span style="color: #00ffff;">sub</span> <span style="color: #4186be;">_accept</span> {
  <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$self</span> = <span style="color: #66cd00;">shift</span>;

  <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">unless</span> <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$handle</span> = $self-&gt;{<span style="color: #ffff00;">handle</span>}-&gt;<span style="color: #ff7f50;">accept</span>;
  $handle-&gt;blocking(0);

  <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Disable Nagle's algorithm</span>
  <span style="color: #ff7f50;">setsockopt</span> $handle&#65292; IPPROTO_TCP&#65292; TCP_NODELAY&#65292; 1;

  <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Start <span class="caps">TLS</span> handshake</span>
  <span style="color: #00ffff;">return</span> $self-&gt;emit_safe(<span style="color: #ffff00;">accept</span> =&gt; $handle) <span style="color: #00ffff;">unless</span> <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$tls</span> = $self-&gt;{<span style="color: #ffff00;">tls</span>};
  weaken $self;
  $tls-&gt;{<span style="color: #ffff00;">SSL_error_trap</span>} = <span style="color: #00ffff;">sub</span> {
    <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">unless</span> <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$handle</span> = <span style="color: #66cd00;">delete</span> $self-&gt;{<span style="color: #ffff00;">handles</span>}{<span style="color: #66cd00;">shift</span>()};
    $self-&gt;reactor-&gt;remove($handle);
    <span style="color: #ff7f50;">close</span> $handle;
  };
  <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">unless</span> $handle = <span class="caps">IO</span>::Socket::SSL-&gt;start_SSL($handle&#65292; <span style="color: #ff0000; background-color: #eeeed1; font-weight: bold; font-style: italic;">%</span><span style="color: #ffffff; font-weight: bold;">$tls</span>);
  $self-&gt;reactor-&gt;io($handle =&gt; <span style="color: #00ffff;">sub</span> { $self-&gt;_tls($handle) });
  $self-&gt;{<span style="color: #ffff00;">handles</span>}{$handle} = $handle;
}
</pre>

</div>

</div>
