org/articles/Perl/2013-06-12-Mojolicious-analyse-2.org
*** listen socket上链接达到
     可以看到当Reactor上面的读写发生时候，这个函数被调用，他执行socket的accept获得新的socket(和client链接的socket)．然后触发了accept事件．\\
     accept事件是什么时候被注册的呢？\\
     Mojo::IOLoop中server方法:
     #+BEGIN_SRC perl :eval no
     sub server {
       my ($self， $cb) = (shift， pop);
       $self = $self->singleton unless ref $self;

       my $server = Mojo::IOLoop::Server->new;
       weaken $self;
       $server->on(
         accept => sub {
           my $handle = pop;
     
           # Turn handle into stream
           my $stream = Mojo::IOLoop::Stream->new($handle);
           $self->$cb($stream， $self->stream($stream));
     
           # Enforce connection limit (randomize to improve load balancing)
           $self->max_connections(0)
             if defined $self->{accepts}
             && ($self->{accepts} -= int(rand 2) + 1) <= 0;
     
           # Stop accepting to release accept mutex
           $self->_not_accepting;
         }
       );
     #+END_SRC
*** 为链接创建Mojo::IOLoop::Stream
     注册了server上面的accept事件，于是这里注册的处理函数被执行，观察到，他创建了一个Mojo::IOLoop::Stream实例，表示Client和Server的这条链接．然后执行了一个callback．\\
     这个callback是什么呢？\\
     由于这里的server方法是被Mojo::Server::Daemon的\_listen方法调用用来创建acceptor．在那里可以看到提供了此回调:
     #+BEGIN_SRC perl :eval no
     sub _listen {
       my ($self， $listen) = @_;
       ．．．
       weaken $self;
       my $id = $self->ioloop->server(
         $options => sub {
           my ($loop， $stream， $id) = @_;
     
           my $c = $self->{connections}{$id} = {tls => $tls};
           warn "-- Accept (@{[$stream->handle->peerhost]})\n" if DEBUG;
           $stream->timeout($self->inactivity_timeout);
     
           $stream->on(close => sub { $self->_close($id) });
           $stream->on(
             error => sub {
               return unless $self;
               $self->app->log->error(pop);
               $self->_close($id);
             }
           );
           $stream->on(read => sub { $self->_read($id => pop) });
           $stream->on(timeout =>
               sub { $self->app->log->debug('Inactivity timeout．') if $c->{tx} });
        }
     );
     ．．．
     #+END_SRC
*** client发来数据
   这个回掉注册了stream上面的事件处理:close，error，read，timeout等．read方法，表示链接上有数据达到，即client发来数据:
     #+BEGIN_SRC perl :eval no
     sub _read {
       my ($self， $id， $chunk) = @_;
     
       # Make sure we have a transaction and parse chunk
       return unless my $c = $self->{connections}{$id};
       my $tx = $c->{tx} ||= $self->_build_tx($id， $c);
       warn "-- Server <<< Client (@{[$tx->req->url->to_abs]})\n$chunk\n" if DEBUG;
       $tx->server_read($chunk);
     
       # Last keep-alive request or corrupted connection
       $tx->res->headers->connection('close')
         if (($c->{requests} || 0) >= $self->max_requests) || $tx->req->error;
     
       # Finish or start writing
       if ($tx->is_finished) { $self->_finish($id， $tx) }
       elsif ($tx->is_writing) { $self->_write($id) }
     }
     #+END_SRC
