www/articles/Perl/2013/06/12/2013-06-12-Mojolicious-analyse-2.html

<div id="outline-container-1-2" class="outline-4">
<h4 id="sec-1-2">listen&nbsp;socket上链接达到</h4>
<div class="outline-text-4" id="text-1-2">

<p>     可以看到当Reactor上面的读写发生时候，这个函数被调用，他执行socket的accept获得新的socket(和client链接的socket)．然后触发了accept事件．<br/>
     accept事件是什么时候被注册的呢？<br/>&nbsp;Mojo::IOLoop中server方法:
</p>


<pre class="src src-perl"><span style="color: #00ffff;">sub</span> <span style="color: #4186be;">server</span> {
  <span style="color: #00ffff;">my</span> (<span style="color: #ffffff; font-weight: bold;">$self</span>&#65292; $cb) = (<span style="color: #66cd00;">shift</span>&#65292; <span style="color: #66cd00;">pop</span>);
  $self = $self-&gt;singleton <span style="color: #00ffff;">unless</span> <span style="color: #ff7f50;">ref</span> $self;

  <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$server</span> = Mojo::IOLoop::Server-&gt;new;
  weaken $self;
  $server-&gt;on(
    <span style="color: #ffff00;">accept</span> =&gt; <span style="color: #00ffff;">sub</span> {
      <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$handle</span> = <span style="color: #66cd00;">pop</span>;

      <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Turn handle into stream</span>
      <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$stream</span> = Mojo::IOLoop::Stream-&gt;new($handle);
      $self-&gt;$cb($stream&#65292; $self-&gt;stream($stream));

      <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Enforce connection limit (randomize to improve load balancing)</span>
      $self-&gt;max_connections(0)
        <span style="color: #00ffff;">if</span> <span style="color: #66cd00;">defined</span> $self-&gt;{<span style="color: #ffff00;">accepts</span>}
        &amp;&amp; ($self-&gt;{<span style="color: #ffff00;">accepts</span>} -= <span style="color: #ff7f50;">int</span>(<span style="color: #ff7f50;">rand</span> 2) + 1) &lt;= 0;

      <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Stop accepting to release accept mutex</span>
      $self-&gt;_not_accepting;
    }
  );
</pre>

</div>

</div>

<div id="outline-container-1-3" class="outline-4">
<h4 id="sec-1-3">为链接创建Mojo::IOLoop::Stream</h4>
<div class="outline-text-4" id="text-1-3">

<p>     注册了server上面的accept事件，于是这里注册的处理函数被执行，观察到，他创建了一个Mojo::IOLoop::Stream实例，表示Client和Server的这条链接．然后执行了一个callback．<br/>
     这个callback是什么呢？<br/>&nbsp;由于这里的server方法是被Mojo::Server::Daemon的_listen方法调用用来创建acceptor．在那里可以看到提供了此回调:
</p>


<pre class="src src-perl"><span style="color: #00ffff;">sub</span> <span style="color: #4186be;">_listen</span> {
  <span style="color: #00ffff;">my</span> (<span style="color: #ffffff; font-weight: bold;">$self</span>&#65292; $listen) = <span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@_</span>;
  &#65294;&#65294;&#65294;
  weaken $self;
  <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$id</span> = $self-&gt;ioloop-&gt;server(
    $options =&gt; <span style="color: #00ffff;">sub</span> {
      <span style="color: #00ffff;">my</span> (<span style="color: #ffffff; font-weight: bold;">$loop</span>&#65292; $stream&#65292; $id) = <span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@_</span>;

      <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$c</span> = $self-&gt;{<span style="color: #ffff00;">connections</span>}{$id} = {<span style="color: #ffff00;">tls</span> =&gt; $tls};
      <span style="color: #ff7f50;">warn</span> <span style="color: #ffff00;">"-- Accept (@{[$stream-&gt;handle-&gt;peerhost]})\n"</span> <span style="color: #00ffff;">if</span> <span class="caps">DEBUG</span>;
      $stream-&gt;timeout($self-&gt;inactivity_timeout);

      $stream-&gt;on(<span style="color: #ffff00;">close</span> =&gt; <span style="color: #00ffff;">sub</span> { $self-&gt;_close($id) });
      $stream-&gt;on(
        <span style="color: #ffff00;">error</span> =&gt; <span style="color: #00ffff;">sub</span> {
          <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">unless</span> $self;
          $self-&gt;app-&gt;<span style="color: #ff7f50;">log</span>-&gt;error(<span style="color: #66cd00;">pop</span>);
          $self-&gt;_close($id);
        }
      );
      $stream-&gt;on(<span style="color: #ffff00;">read</span> =&gt; <span style="color: #00ffff;">sub</span> { $self-&gt;_read($id =&gt; <span style="color: #66cd00;">pop</span>) });
      $stream-&gt;on(<span style="color: #ffff00;">timeout</span> =&gt;
          <span style="color: #00ffff;">sub</span> { $self-&gt;app-&gt;<span style="color: #ff7f50;">log</span>-&gt;debug(<span style="color: #ffff00;">'Inactivity timeout&#65294;'</span>) <span style="color: #00ffff;">if</span> $c-&gt;{<span style="color: #ffff00;">tx</span>} });
   }
);
&#65294;&#65294;&#65294;
</pre>

</div>

</div>

<div id="outline-container-1-4" class="outline-4">
<h4 id="sec-1-4">client发来数据</h4>
<div class="outline-text-4" id="text-1-4">

<p>   这个回掉注册了stream上面的事件处理:close，error，read，timeout等．read方法，表示链接上有数据达到，即client发来数据:
</p>


<pre class="src src-perl"><span style="color: #00ffff;">sub</span> <span style="color: #4186be;">_read</span> {
  <span style="color: #00ffff;">my</span> (<span style="color: #ffffff; font-weight: bold;">$self</span>&#65292; $id&#65292; $chunk) = <span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@_</span>;

  <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Make sure we have a transaction and parse chunk</span>
  <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">unless</span> <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$c</span> = $self-&gt;{<span style="color: #ffff00;">connections</span>}{$id};
  <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$tx</span> = $c-&gt;{<span style="color: #ffff00;">tx</span>} ||= $self-&gt;_build_tx($id&#65292; $c);
  <span style="color: #ff7f50;">warn</span> <span style="color: #ffff00;">"-- Server &lt;&lt;&lt; Client (@{[$tx-&gt;req-&gt;url-&gt;to_abs]})\n$chunk\n"</span> <span style="color: #00ffff;">if</span> <span class="caps">DEBUG</span>;
  $tx-&gt;server_read($chunk);

  <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Last keep-alive request or corrupted connection</span>
  $tx-&gt;res-&gt;headers-&gt;connection(<span style="color: #ffff00;">'close'</span>)
    <span style="color: #00ffff;">if</span> (($c-&gt;{<span style="color: #ffff00;">requests</span>} || 0) &gt;= $self-&gt;max_requests) || $tx-&gt;req-&gt;error;

  <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Finish or start writing</span>
  <span style="color: #00ffff;">if</span> ($tx-&gt;is_finished) { $self-&gt;_finish($id&#65292; $tx) }
  <span style="color: #00ffff;">elsif</span> ($tx-&gt;is_writing) { $self-&gt;_write($id) }
}
</pre>

</div>

</div>
