org/articles/Perl/2013-06-12-Mojolicious-analyse-2.org
*** transaction被创建并处理数据
   此方法创建transaction(如果链接上有tx就复用)，注意调次方法被调用的时候数据已经就绪了，在$chunk中\\
   调用transacton上面的server\_read方法，这个方法并不会从socket读数据(因为数据已经读上来，在$chunk中)，而是进行分析数据:
     #+BEGIN_SRC perl :eval no
     # Mojo::Transaction::HTTP
     sub server_read {
       my ($self， $chunk) = @_;
     
       # Parse request
       my $req = $self->req;
       $req->parse($chunk) unless $req->error;
       $self->{state} ||= 'read';
     
       # Generate response
       return unless $req->is_finished && !$self->{handled}++;
       $self->emit(upgrade => Mojo::Transaction::WebSocket->new(handshake => $self))
         if lc($req->headers->upgrade // '') eq 'websocket';
       $self->emit('request');
     }
     #+END_SRC
     此方法调用$req->parse方法分析数据，先分析HTTP头，然后使用Mojo::Content分析headers和body，如果完整那么一次就可以分析完，状态变为finished，
     于是本函数的最后一行被调用，触发request事件．\\
     事件处理函数是？\\
     由于tx是在Mojo::Daemon::\_read方法内调用\_build\_tx构建:
     #+BEGIN_SRC perl :eval no
     sub _build_tx {
       my ($self， $id， $c) = @_;
     
       my $tx = $self->build_tx->connection($id);
       $tx->res->headers->server('Mojolicious (Perl)');
       my $handle = $self->ioloop->stream($id)->handle;
       $tx->local_address($handle->sockhost)->local_port($handle->sockport);
       $tx->remote_address($handle->peerhost)->remote_port($handle->peerport);
       $tx->req->url->base->scheme('https') if $c->{tls};
     
       # Handle upgrades and requests
       weaken $self;
       $tx->on(
         upgrade => sub {
           my ($tx， $ws) = @_;
           $ws->server_handshake;
           $self->{connections}{$id}{ws} = $ws;
         }
       );
       $tx->on(
         request => sub {
           my $tx = shift;
           $self->emit(request => $self->{connections}{$id}{ws} || $tx);
           $tx->on(resume => sub { $self->_write($id) });
         }
       );
     
       # Kept alive if we have more than one request on the connection
       return ++$c->{requests} > 1 ? $tx->kept_alive(1) : $tx;
     }
     #+END_SRC
*** 数据分析完整触发tx上的request事件
     request事件的处理函数会执行Mojo::Server::Daemon实例上注册的request处理函数，传递tx作为参数:
     #+BEGIN_SRC perl :eval no
     # Mojo::Server
     sub new {
       my $self = shift->SUPER::new(@_);
       $self->on(request => sub { shift->app->handler(shift) });
       return $self;
     }
     #+END_SRC
     可以看到这里会调用app上面的handler函数:
*** 执行app上的handler方法
   handler方法在Mojolicious．pm中，handler方法目的是生成response(响应内容):
   - redirect
   - static 资源
   - route到app自定义的controller
   在生成response，且如果需要渲染模板而渲染后，执行rendered方法，次方法是收尾工作，在次方法的最后执行:
   #+BEGIN_SRC perl :eval no
   sub rendered {
       ．．．
       $self->tx->resume;
       return $self;
   }
   #+END_SRC
   唤醒了tx:
*** tx被唤醒写response数据到链接
   在Mojo::Server::Daemon::\_build\_tx内:
   #+BEGIN_SRC perl :eval no
   $tx->on(resume => sub { $self->_write($id) });
   #+END_SRC
   可以看到Mojo::Server::Daemon的\_write方法被执行:
   #+BEGIN_SRC perl :eval no
   sub _write {
       my ($self， $id) = @_;
     
       # Not writing
       return unless my $c  = $self->{connections}{$id};
       return unless my $tx = $c->{tx};
       return unless $tx->is_writing;
     
       # Get chunk and write
       return if $c->{writing}++;
       my $chunk = $tx->server_write;
       delete $c->{writing};
       warn "-- Server >>> Client (@{[$tx->req->url->to_abs]})\n$chunk\n" if DEBUG;
       my $stream = $self->ioloop->stream($id)->write($chunk);
     
       # Finish or continue writing
       weaken $self;
       my $cb = sub { $self->_write($id) };
       if ($tx->is_finished) {
         if ($tx->has_subscribers('finish')) {
           $cb = sub { $self->_finish($id， $tx) }
         }
         else {
           $self->_finish($id， $tx);
           return unless $c->{tx};
         }
       }
       $stream->write(''， $cb);
     }
   #+END_SRC
   此方法的目的是写response给客户端，调用tx->server\_write获得要写的数据，然后在connection绑定的Mojo::IOLoop::Stream实例上面调用write方法写出数据．
   如果tx数据完整则状态为finished，调用Mojo::Server::Daemon的\_finish方法，结束tx:
*** 结束tx
   #+BEGIN_SRC perl :eval no
   sub _finish {
       my ($self， $id， $tx) = @_;
     
       # Always remove connection for WebSockets
       return $self->_remove($id) if $tx->is_websocket;
     
       # Finish transaction
       $tx->server_close;
       ．．．
       # Close connection if necessary
       my $req = $tx->req;
      return $self->_remove($id) if $req->error || !$tx->keep_alive;
   #+END_SRC
   从这里可以看出tx被设置为finished，如果非keepalive链接，还会关闭链接(同时删除了tx，tx属于connection)．

至此请求处理完成

