www/articles/Perl/2013/06/12/2013-06-12-Mojolicious-analyse-2.html

<div id="outline-container-1-5" class="outline-4">
<h4 id="sec-1-5">transaction被创建并处理数据</h4>
<div class="outline-text-4" id="text-1-5">

<p>   此方法创建transaction(如果链接上有tx就复用)，注意调次方法被调用的时候数据已经就绪了，在$chunk中<br/>&nbsp;调用transacton上面的server_read方法，这个方法并不会从socket读数据(因为数据已经读上来，在$chunk中)，而是进行分析数据:
</p>


<pre class="src src-perl"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">Mojo::Transaction::<span class="caps">HTTP</span></span>
<span style="color: #00ffff;">sub</span> <span style="color: #4186be;">server_read</span> {
  <span style="color: #00ffff;">my</span> (<span style="color: #ffffff; font-weight: bold;">$self</span>&#65292; $chunk) = <span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@_</span>;

  <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Parse request</span>
  <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$req</span> = $self-&gt;req;
  $req-&gt;parse($chunk) <span style="color: #00ffff;">unless</span> $req-&gt;error;
  $self-&gt;{<span style="color: #ffff00;">state</span>} ||= <span style="color: #ffff00;">'read'</span>;

  <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Generate response</span>
  <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">unless</span> $req-&gt;is_finished &amp;&amp; !$self-&gt;{<span style="color: #ffff00;">handled</span>}++;
  $self-&gt;emit(<span style="color: #ffff00;">upgrade</span> =&gt; Mojo::Transaction::WebSocket-&gt;new(<span style="color: #ffff00;">handshake</span> =&gt; $self))
    <span style="color: #00ffff;">if</span> <span style="color: #ff7f50;">lc</span>($req-&gt;headers-&gt;upgrade // <span style="color: #ffff00;">''</span>) <span style="color: #ff7f50;">eq</span> <span style="color: #ffff00;">'websocket'</span>;
  $self-&gt;emit(<span style="color: #ffff00;">'request'</span>);
}
</pre>

<p>
     此方法调用$req-&gt;parse方法分析数据，先分析<span class="caps">HTTP</span>头，然后使用Mojo::Content分析headers和body，如果完整那么一次就可以分析完，状态变为finished，
     于是本函数的最后一行被调用，触发request事件．<br/>
     事件处理函数是？<br/>&nbsp;由于tx是在Mojo::Daemon::_read方法内调用_build_tx构建:
</p>


<pre class="src src-perl"><span style="color: #00ffff;">sub</span> <span style="color: #4186be;">_build_tx</span> {
  <span style="color: #00ffff;">my</span> (<span style="color: #ffffff; font-weight: bold;">$self</span>&#65292; $id&#65292; $c) = <span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@_</span>;

  <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$tx</span> = $self-&gt;build_tx-&gt;connection($id);
  $tx-&gt;res-&gt;headers-&gt;server(<span style="color: #ffff00;">'Mojolicious (Perl)'</span>);
  <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$handle</span> = $self-&gt;ioloop-&gt;stream($id)-&gt;handle;
  $tx-&gt;local_address($handle-&gt;sockhost)-&gt;local_port($handle-&gt;sockport);
  $tx-&gt;remote_address($handle-&gt;peerhost)-&gt;remote_port($handle-&gt;peerport);
  $tx-&gt;req-&gt;url-&gt;base-&gt;scheme(<span style="color: #ffff00;">'https'</span>) <span style="color: #00ffff;">if</span> $c-&gt;{<span style="color: #ffff00;">tls</span>};

  <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Handle upgrades and requests</span>
  weaken $self;
  $tx-&gt;on(
    <span style="color: #ffff00;">upgrade</span> =&gt; <span style="color: #00ffff;">sub</span> {
      <span style="color: #00ffff;">my</span> (<span style="color: #ffffff; font-weight: bold;">$tx</span>&#65292; $ws) = <span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@_</span>;
      $ws-&gt;server_handshake;
      $self-&gt;{<span style="color: #ffff00;">connections</span>}{$id}{<span style="color: #ffff00;">ws</span>} = $ws;
    }
  );
  $tx-&gt;on(
    <span style="color: #ffff00;">request</span> =&gt; <span style="color: #00ffff;">sub</span> {
      <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$tx</span> = <span style="color: #66cd00;">shift</span>;
      $self-&gt;emit(<span style="color: #ffff00;">request</span> =&gt; $self-&gt;{<span style="color: #ffff00;">connections</span>}{$id}{<span style="color: #ffff00;">ws</span>} || $tx);
      $tx-&gt;on(<span style="color: #ffff00;">resume</span> =&gt; <span style="color: #00ffff;">sub</span> { $self-&gt;_write($id) });
    }
  );

  <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Kept alive if we have more than one request on the connection</span>
  <span style="color: #00ffff;">return</span> ++$c-&gt;{<span style="color: #ffff00;">requests</span>} &gt; 1 ? $tx-&gt;kept_alive(1) : $tx;
}
</pre>

</div>

</div>

<div id="outline-container-1-6" class="outline-4">
<h4 id="sec-1-6">数据分析完整触发tx上的request事件</h4>
<div class="outline-text-4" id="text-1-6">

<p>     request事件的处理函数会执行Mojo::Server::Daemon实例上注册的request处理函数，传递tx作为参数:
</p>


<pre class="src src-perl"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">Mojo::Server</span>
<span style="color: #00ffff;">sub</span> <span style="color: #4186be;">new</span> {
  <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$self</span> = <span style="color: #66cd00;">shift</span>-&gt;<span class="caps">SUPER</span>::new(<span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@_</span>);
  $self-&gt;on(<span style="color: #ffff00;">request</span> =&gt; <span style="color: #00ffff;">sub</span> { <span style="color: #66cd00;">shift</span>-&gt;app-&gt;handler(<span style="color: #66cd00;">shift</span>) });
  <span style="color: #00ffff;">return</span> $self;
}
</pre>

<p>
     可以看到这里会调用app上面的handler函数:
</p></div>

</div>

<div id="outline-container-1-7" class="outline-4">
<h4 id="sec-1-7">执行app上的handler方法</h4>
<div class="outline-text-4" id="text-1-7">

<p>   handler方法在Mojolicious．pm中，handler方法目的是生成response(响应内容):
</p><ul>
<li>redirect
</li>
<li>static&nbsp;资源
</li>
<li>route到app自定义的controller
</li>
</ul>

<p>   在生成response，且如果需要渲染模板而渲染后，执行rendered方法，次方法是收尾工作，在次方法的最后执行:
</p>


<pre class="src src-perl"><span style="color: #00ffff;">sub</span> <span style="color: #4186be;">rendered</span> {
    &#65294;&#65294;&#65294;
    $self-&gt;tx-&gt;resume;
    <span style="color: #00ffff;">return</span> $self;
}
</pre>

<p>
   唤醒了tx:
</p></div>

</div>

<div id="outline-container-1-8" class="outline-4">
<h4 id="sec-1-8">tx被唤醒写response数据到链接</h4>
<div class="outline-text-4" id="text-1-8">

<p>   在Mojo::Server::Daemon::_build_tx内:
</p>


<pre class="src src-perl">$tx-&gt;on(<span style="color: #ffff00;">resume</span> =&gt; <span style="color: #00ffff;">sub</span> { $self-&gt;_write($id) });
</pre>

<p>
   可以看到Mojo::Server::Daemon的_write方法被执行:
</p>


<pre class="src src-perl"><span style="color: #00ffff;">sub</span> <span style="color: #4186be;">_write</span> {
    <span style="color: #00ffff;">my</span> (<span style="color: #ffffff; font-weight: bold;">$self</span>&#65292; $id) = <span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@_</span>;

    <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Not writing</span>
    <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">unless</span> <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$c</span>  = $self-&gt;{<span style="color: #ffff00;">connections</span>}{$id};
    <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">unless</span> <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$tx</span> = $c-&gt;{<span style="color: #ffff00;">tx</span>};
    <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">unless</span> $tx-&gt;is_writing;

    <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Get chunk and write</span>
    <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">if</span> $c-&gt;{<span style="color: #ffff00;">writing</span>}++;
    <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$chunk</span> = $tx-&gt;server_write;
    <span style="color: #66cd00;">delete</span> $c-&gt;{<span style="color: #ffff00;">writing</span>};
    <span style="color: #ff7f50;">warn</span> <span style="color: #ffff00;">"-- Server &gt;&gt;&gt; Client (@{[$tx-&gt;req-&gt;url-&gt;to_abs]})\n$chunk\n"</span> <span style="color: #00ffff;">if</span> <span class="caps">DEBUG</span>;
    <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$stream</span> = $self-&gt;ioloop-&gt;stream($id)-&gt;<span style="color: #ff7f50;">write</span>($chunk);

    <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Finish or continue writing</span>
    weaken $self;
    <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$cb</span> = <span style="color: #00ffff;">sub</span> { $self-&gt;_write($id) };
    <span style="color: #00ffff;">if</span> ($tx-&gt;is_finished) {
      <span style="color: #00ffff;">if</span> ($tx-&gt;has_subscribers(<span style="color: #ffff00;">'finish'</span>)) {
        $cb = <span style="color: #00ffff;">sub</span> { $self-&gt;_finish($id&#65292; $tx) }
      }
      <span style="color: #00ffff;">else</span> {
        $self-&gt;_finish($id&#65292; $tx);
        <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">unless</span> $c-&gt;{<span style="color: #ffff00;">tx</span>};
      }
    }
    $stream-&gt;<span style="color: #ff7f50;">write</span>(<span style="color: #ffff00;">''</span>&#65292; $cb);
  }
</pre>

<p>
   此方法的目的是写response给客户端，调用tx-&gt;server_write获得要写的数据，然后在connection绑定的Mojo::IOLoop::Stream实例上面调用write方法写出数据．&nbsp;如果tx数据完整则状态为finished，调用Mojo::Server::Daemon的_finish方法，结束tx:
</p></div>

</div>

<div id="outline-container-1-9" class="outline-4">
<h4 id="sec-1-9">结束tx</h4>
<div class="outline-text-4" id="text-1-9">




<pre class="src src-perl"><span style="color: #00ffff;">sub</span> <span style="color: #4186be;">_finish</span> {
    <span style="color: #00ffff;">my</span> (<span style="color: #ffffff; font-weight: bold;">$self</span>&#65292; $id&#65292; $tx) = <span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@_</span>;

    <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Always remove connection for WebSockets</span>
    <span style="color: #00ffff;">return</span> $self-&gt;_remove($id) <span style="color: #00ffff;">if</span> $tx-&gt;is_websocket;

    <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Finish transaction</span>
    $tx-&gt;server_close;
    &#65294;&#65294;&#65294;
    <span style="color: #ff0000;"># </span><span style="color: #ff0000;">Close connection if necessary</span>
    <span style="color: #00ffff;">my</span> <span style="color: #ffffff; font-weight: bold;">$req</span> = $tx-&gt;req;
   <span style="color: #00ffff;">return</span> $self-&gt;_remove($id) <span style="color: #00ffff;">if</span> $req-&gt;error || !$tx-&gt;keep_alive;
</pre>

<p>
   从这里可以看出tx被设置为finished，如果非keepalive链接，还会关闭链接(同时删除了tx，tx属于connection)．
</p>
<p>
至此请求处理完成
</p>
</div>
</div>

</div>
